tools/cfdvv/cases/verification/compressible/sod-shock-tube/openfoam/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application rhoPimpleFoam;
allowSystemOperations true;
startFrom startTime; startTime 0; stopAt endTime; endTime 0.2;
deltaT 1e-6; writeControl adjustableRunTime; writeInterval 0.05;
adjustTimeStep yes; maxCo 0.5; maxDeltaT 1;
functions {
    sampleDict {
        type sets;
        libs ("libsampling.so");
        writeControl outputTime;
        interpolationScheme cellPoint;
        setFormat csv;
        fields (rho U p);
        sets (
            line {
                type lineUniform; axis x;
                start (0 0.005 0.005); end (1 0.005 0.005); nPoints 1000;
            }
        );
    }
}
