tools/cfdvv/cases/verification/compressible/sod-shock-tube/openfoam/constant/momentumTransport
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}

simulationType laminar;

// ************************************************************************* //
