tools/cfdvv/cases/verification/compressible/sod-shock-tube/openfoam/constant/physicalProperties
FoamFile { version 2.0; format ascii; class dictionary; object physicalProperties; }
thermoType {
    type hePsiThermo;
    mixture pureMixture;
    transport const;
    thermo hConst;
    equationOfState perfectGas;
    specie specie;
    energy sensibleInternalEnergy;
}
mixture {
    specie { nMoles 1; molWeight 8314; }
    thermodynamics { Cp 3.5; Hf 0; Tstd 0; }
    transport { mu 0; Pr 1; }
}
