tools/cfdvv/cases/verification/compressible/sod-shock-tube/openfoam/0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [1 -1 -2 0 0 0 0]; internalField uniform 0.1;
boundaryField {
    left  { type zeroGradient; }
    right { type zeroGradient; }
    walls { type empty; }
}
