tools/cfdvv/cases/verification/compressible/sod-shock-tube/openfoam/0/T
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
dimensions [0 0 0 1 0 0 0]; internalField uniform 0.8;
boundaryField {
    left  { type zeroGradient; }
    right { type zeroGradient; }
    walls { type empty; }
}
