tools/cfdvv/cases/verification/compressible/sod-shock-tube/openfoam/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }

solvers
{
    "(p|U|e|h).*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-12;
        relTol          0;
    }

    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }
}

PIMPLE
{
    transonic yes;
    consistent yes;
    nOuterCorrectors     3;
    nCorrectors          1;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    fields
    {
        ".*"   1;
    }
    equations
    {
        ".*"   1;
    }
}
