tools/cfdvv/cases/verification/compressible/sod-shock-tube/openfoam/system/sampleDict
FoamFile { version 2.0; format ascii; class dictionary; object sampleDict; }
setFormat csv;
interpolationScheme cellPoint;
fields (rho U p);
sets (
    line {
        type uniform; axis x;
        start (0 0.005 0.005); end (1 0.005 0.005); nPoints 1000;
    }
);
