tools/cfdvv/cases/verification/compressible/sod-shock-tube/openfoam/system/setFieldsDict
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }
defaultFieldValues (
    volScalarFieldValue p 0.1
    volScalarFieldValue T 0.8
    volVectorFieldValue U (0 0 0)
);
regions (
    boxToCell {
        box (0 0 0) (0.5 0.01 0.01);
        fieldValues (
            volScalarFieldValue p 1.0
            volScalarFieldValue T 1.0
        );
     }
);
